***
# 4.03 Pandas Configuring Options, Data Type Conversion, Missing Data
- Pandas Documentation: https://pandas.pydata.org/
***
### Python 4.01. Series
### Python 4.02. Pandas DataFrame, Selection, and Indexing
### Python 4.03. Configuring Options, Data Type Conversion, Working with strings and dates, Missing Data
### Python 4.04. Groupby, Categorizing, and Labeling Data
### Python 4.05. Merging,Joining,and Concatenating
### Python 4.06. Pipe, Apply, Applymap, Map, Pivot Table, and Cotingency Table
### Python 4.07. Data Input and Output
### Python 4.08. Data Visualization
### Python 4.09. Exploratory Data Analysis and Beyond
### Python 4.10. Breakout Group Exercise and Solution
***

In [76]:
import pandas as pd
import os
# Set up a path to data folder import os
os.chdir(r'C:\Users\yumei\CSP Workshop 2023\Data')
os.getcwd()

'C:\\Users\\yumei\\CSP Workshop 2023\\Data'

## Table of Contents - Pandas Configuring Options, Data Type Conversion, Missing Data

### Section 1. Configuring Options Using Pandas
### Section 2. Data Type Conversion
### Section 3. Working With Strings
### Section 4. Working With Dates
### Section 5. Missing Data
### Section 6. Conversion of 0s to NaNs so 0s are not Included in Statistics (sum/mean/std) Calculation

## Section 1. Configuring Options Using Pandas

### 1) set_option()

### 2) get_option()

### 3) reset_option()

In [77]:
emissions = pd.DataFrame({"country":["China", "India", "US"],
                          "year":["2019","2020","2021"],
                          "co2_emissions":[10060000000.0,2650000000.0,5410000000.0]})
emissions

  country  year    co2_emissions
0   China  2019 10,060,000,000.0
1   India  2020  2,650,000,000.0
2      US  2021  5,410,000,000.0

In [78]:
# Setting the values

pd.set_option('display.max_row',4)
pd.set_option('display.min_row',2)
pd.set_option('display.max_columns',2)

In [79]:
# Displaying the altered values

print("The altered values are: \n")
print("Value of max_rows: " + str(pd.get_option("display.max_rows")))
print("Value of min_rows: " + str(pd.get_option("display.min_rows")))
print("Value of max_columns: " + str(pd.get_option("display.max_columns")))

The altered values are:

Value of max_rows: 4
Value of min_rows: 2
Value of max_columns: 2

In [80]:
# Resetting the values of all the options at once by passing "all"
# as the parameter in the pandas.reset_option()"

pd.reset_option('display.max_row')
pd.reset_option('display.min_row')
pd.reset_option('display.max_columns')

In [83]:
# Displaying the values to default

print("\nThe default values are: \n")
print("Value of max_rows: " + str(pd.get_option("display.max_rows")))
print("Value of min_rows: " + str(pd.get_option("display.min_rows")))
print("Value of max_columns: " + str(pd.get_option("display.max_columns")))

The default values are:

Value of max_rows: 60
Value of min_rows: 10
Value of max_columns: 20

In [84]:
pd.reset_option('all')

C:\Users\yumei\AppData\Local\Temp/ipykernel_72500/2786130087.py:1: FutureWarning: column_space is deprecated and will be removed in a future version. Use df.to_string(col_space=...) instead.
  pd.reset_option('all')
C:\Users\yumei\AppData\Local\Temp/ipykernel_72500/2786130087.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead.
  pd.reset_option('all')
C:\Users\yumei\AppData\Local\Temp/ipykernel_72500/2786130087.py:1: FutureWarning:
: boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.

  pd.reset_option('all')

In [85]:
# Displaying all the values reset to default

print("\nThe default values are: \n")
print("Value of max_rows: " + str(pd.get_option("display.max_rows")))
print("Value of min_rows: " + str(pd.get_option("display.min_rows")))
print("Value of max_columns: " + str(pd.get_option("display.max_columns")))

The default values are:

Value of max_rows: 60
Value of min_rows: 10
Value of max_columns: 20

In [86]:
pd.options.display.float_format='{:,.1f}'.format
emissions

  country  year    co2_emissions
0   China  2019 10,060,000,000.0
1   India  2020  2,650,000,000.0
2      US  2021  5,410,000,000.0

## Section 2. Data Type Conversion

In [87]:
%pwd

'C:\\Users\\yumei\\CSP Workshop 2023\\Data'

In [89]:
df = pd.read_csv('BankMarketingAdditional.csv')
df

,age,job,marital,education,default,housing,loan,contact,year,month,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
1,57,services,married,high.school,unknown,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
2,37,services,married,high.school,no,yes,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
3,40,admin.,married,basic.6y,no,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
4,56,services,married,high.school,no,no,yes,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,no,yes,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",no
41185,56,retired,married,university.degree,no,yes,no,cellular,2000,nov,...,2,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",no
41186,44,technician,married,professional.course,no,no,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",yes
41187,74,retired,married,professional.course,no,yes,no,cellular,2000,nov,...,3,999,1,failure,-1.1,94.8,-50.8,1.0,"4,963.6",no

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 22 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41188 non-null  int64
 1   job             41188 non-null  object
 2   marital         41188 non-null  object
 3   education       41188 non-null  object
 4   default         41188 non-null  object
 5   housing         41188 non-null  object
 6   loan            41188 non-null  object
 7   contact         41188 non-null  object
 8   year            41188 non-null  int64
 9   month           41188 non-null  object
 10  day_of_week     41188 non-null  object
 11  duration        41188 non-null  int64
 12  campaign        41188 non-null  int64
 13  pdays           41188 non-null  int64
 14  previous        41188 non-null  int64
 15  poutcome        41188 non-null  object
 16  emp.var.rate    41188 non-null  float64
 17  cons.price.idx  41188 non-null  float64
 18  cons.conf.idx   41188 non-null  float64
 19  euribor3m       41188 non-null  float64
 20  nr.employed     41188 non-null  float64
 21  y               41188 non-null  object
dtypes: float64(5), int64(6), object(11)
memory usage: 6.9+ MB

In [91]:
df.head(3)

,age,job,marital,education,default,housing,loan,contact,year,month,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
1,57,services,married,high.school,unknown,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
2,37,services,married,high.school,no,yes,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no

In [92]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
year                int64
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
y                  object
dtype: object

In [93]:
df.mean()

C:\Users\yumei\AppData\Local\Temp/ipykernel_72500/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

age                 40.0
year             2,000.0
duration           258.3
campaign             2.6
pdays              962.5
previous             0.2
emp.var.rate         0.1
cons.price.idx      93.6
cons.conf.idx      -40.5
euribor3m            3.6
nr.employed      5,167.0
dtype: float64

In [94]:
df

,age,job,marital,education,default,housing,loan,contact,year,month,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
1,57,services,married,high.school,unknown,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
2,37,services,married,high.school,no,yes,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
3,40,admin.,married,basic.6y,no,no,no,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
4,56,services,married,high.school,no,no,yes,telephone,2000,may,...,1,999,0,nonexistent,1.1,94.0,-36.4,4.9,"5,191.0",no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,no,yes,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",no
41185,56,retired,married,university.degree,no,yes,no,cellular,2000,nov,...,2,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",no
41186,44,technician,married,professional.course,no,no,no,cellular,2000,nov,...,1,999,0,nonexistent,-1.1,94.8,-50.8,1.0,"4,963.6",yes
41187,74,retired,married,professional.course,no,yes,no,cellular,2000,nov,...,3,999,1,failure,-1.1,94.8,-50.8,1.0,"4,963.6",no

In [95]:
df['duration'][0]/df['cons.price.idx'][0]

2.776772985509713

In [96]:
df['duration'][0].astype(int)

261

In [97]:
df['duration'][0].astype(float)

261.0

In [98]:
df['year'].astype(str)

0        2000
1        2000
2        2000
3        2000
4        2000
         ...
41183    2000
41184    2000
41185    2000
41186    2000
41187    2000
Name: year, Length: 41188, dtype: object

#### pd.to_datetime(your_date_data, format="Your_datetime_format")

- given a format, convert a string to a datetime object

In [99]:
df['year_dt']=pd.to_datetime(df['year'],format='%Y')
df['year_dt']

0       2000-01-01
1       2000-01-01
2       2000-01-01
3       2000-01-01
4       2000-01-01
           ...
41183   2000-01-01
41184   2000-01-01
41185   2000-01-01
41186   2000-01-01
41187   2000-01-01
Name: year_dt, Length: 41188, dtype: datetime64[ns]

## Section 3. Working With Strings

In [100]:
names = pd.Series([' Najim, Mei  ',' Shao; Sandy  ',' Yu, zoey   '])
names

0      Najim, Mei
1     Shao; Sandy
2       Yu, zoey
dtype: object

#### In Pandas, the string accessor denoted by `.str` enables a host of useful string transformation

In [101]:
names = names.str.replace(';',',')
names

0      Najim, Mei
1     Shao, Sandy
2       Yu, zoey
dtype: object

In [102]:
names.str.len()

0    13
1    14
2    12
dtype: int64

In [103]:
# strip to remove the trailing and leading spaces in the names
names1=names.str.strip()
names1.str.len()

0    10
1    11
2     8
dtype: int64

In [104]:
names2=names.str.lower()
names2
# try names.str.upper()

0      najim, mei
1     shao, sandy
2       yu, zoey
dtype: object

In [105]:
names3=names2.str.split(', ')
names3

0     [ najim, mei  ]
1    [ shao, sandy  ]
2      [ yu, zoey   ]
dtype: object

In [106]:
names4 = pd.Series([i[::-1] for i in names3])  
# since the start and stop are not specified, it means to go through the entire series
names4

0     [mei  ,  najim]
1    [sandy  ,  shao]
2      [zoey   ,  yu]
dtype: object

In [107]:
names5=[' '.join (i) for i in names4]
names5

['mei    najim', 'sandy    shao', 'zoey     yu']

In [108]:
names5=[' '.join (['{}'.format(i) for i in names4])]
names5

["['mei  ', ' najim'] ['sandy  ', ' shao'] ['zoey   ', ' yu']"]

## Section 4.  Working With Dates

In [109]:
daterange = pd.period_range('01/01/2021',freq = '30d', periods = 4)
daterange

PeriodIndex(['2021-01-01', '2021-01-31', '2021-03-02', '2021-04-01'], dtype='period[30D]')

In [110]:
date_df = pd.DataFrame(data = daterange, columns = ["Sample_Date"])
date_df

  Sample_Date
0  2021-01-01
1  2021-01-31
2  2021-03-02
3  2021-04-01

In [111]:
date_df['Date_Difference'] = date_df['Sample_Date'].diff(periods=1)
date_df

  Sample_Date Date_Difference
0  2021-01-01             NaT
1  2021-01-31     <30 * Days>
2  2021-03-02     <30 * Days>
3  2021-04-01     <30 * Days>

In [112]:
# Use astype datetime64 to convert to a date time. 
# By passing M between the square brackets, our date is now at the first of the month
date_df['first_day_of_month'] = date_df['Sample_Date'].values.astype('datetime64[M]')
date_df

  Sample_Date Date_Difference first_day_of_month
0  2021-01-01             NaT         2021-01-01
1  2021-01-31     <30 * Days>         2021-01-01
2  2021-03-02     <30 * Days>         2021-03-01
3  2021-04-01     <30 * Days>         2021-04-01

In [113]:
date_df.dtypes

Sample_Date              period[30D]
Date_Difference               object
first_day_of_month    datetime64[ns]
dtype: object

In [114]:
# Timedelta() function can specify a time span you want to add or subtract from your date
date_df['Sample_Date'] - pd.Timedelta('30 d')

0    2020-12-02
1    2021-01-01
2    2021-01-31
3    2021-03-02
Name: Sample_Date, dtype: period[30D]

## Section 5. Missing Data

### 1) .isnull(), .isna() Method 

### 2) .dropna() Method

### 3) .fillna() Method

### 4) .replace() Method

### 5) .interpolate() Method


****

Let's show a few convenient methods to deal with missing data in pandas:

In [115]:
import numpy as np
import pandas as pd

In [116]:
df = pd.DataFrame({'X':[3,2,np.nan],
                   'Y':[5,np.nan,np.nan],
                   'Z':[6,9,13]})
df

    X   Y   Z
0 3.0 5.0   6
1 2.0 NaN   9
2 NaN NaN  13

In [117]:
df = pd.DataFrame({'X':[3,2,np.nan],
                   'Y':[5,np.nan,np.nan],
                   'Z':[6,9,13]})
df

    X   Y   Z
0 3.0 5.0   6
1 2.0 NaN   9
2 NaN NaN  13

### 1) .isnull() Method, isna() Method

In [118]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False   True  False
2   True   True  False

In [119]:
df.isna()

       X      Y      Z
0  False  False  False
1  False   True  False
2   True   True  False

In [120]:
df.isnull().sum()

X    1
Y    2
Z    0
dtype: int64

In [121]:
df.isnull().any(axis=0)

X     True
Y     True
Z    False
dtype: bool

In [122]:
df[df.isnull().any(axis=1)]

    X   Y   Z
1 2.0 NaN   9
2 NaN NaN  13

In [123]:
df[df.isnull().any(axis=1)].count()

X    1
Y    0
Z    2
dtype: int64

### 2) .dropna() Method

In [124]:
df.dropna()  # default is axis=0 to drop rows with missings

    X   Y  Z
0 3.0 5.0  6

In [125]:
df.dropna(axis=1)

    Z
0   6
1   9
2  13

In [126]:
df.dropna(thresh=2)  # thresh : int, optional - require # of non-NA values (in orer to be not dropped)
# Keep only the rows with at least 2 non-NA values.

    X   Y  Z
0 3.0 5.0  6
1 2.0 NaN  9

In [127]:
?df.dropna

### 3) .fillna() Method

Syntax:

- Mean: data=data.fillna(data.mean())

- Median: data=data.fillna(data.median())

- Standard Deviation: data=data.fillna(data.std())

- Min: data=data.fillna(data.min())

- Max: data=data.fillna(data.max())

In [128]:
df.fillna(value='IMPUTE VALUE')

              X             Y   Z
0           3.0           5.0   6
1           2.0  IMPUTE VALUE   9
2  IMPUTE VALUE  IMPUTE VALUE  13

In [129]:
df.fillna(value=0)

    X   Y   Z
0 3.0 5.0   6
1 2.0 0.0   9
2 0.0 0.0  13

In [130]:
df

    X   Y   Z
0 3.0 5.0   6
1 2.0 NaN   9
2 NaN NaN  13

In [131]:
df['X']

0   3.0
1   2.0
2   NaN
Name: X, dtype: float64

In [132]:
value=df['Z'].mean()
value

9.333333333333334

In [133]:
df.fillna(value=df['Z'].mean())

    X   Y   Z
0 3.0 5.0   6
1 2.0 9.3   9
2 9.3 9.3  13

In [134]:
df['X'].fillna(value=df['Z'].mean())

0   3.0
1   2.0
2   9.3
Name: X, dtype: float64

In [135]:
df2=df['X'].fillna(value=df['Z'].mean())

In [136]:
df2

0   3.0
1   2.0
2   9.3
Name: X, dtype: float64

Exercise: use dropna and fillna
```markdown    
    df = pd.DataFrame({'A':[1,2,np.nan,3],
                       'B':[5,np.nan,np.nan,4],
                       'C':[1,2,3,0],
                       'D':[np.nan,np.nan,np.nan,0]})
```

In [137]:
df3 = pd.DataFrame({'A':[1,2,np.nan,3],
                   'B':[5,np.nan,np.nan,4],
                   'C':[1,2,3,0],
                   'D':[np.nan,np.nan,np.nan,0]})
df3

    A   B  C   D
0 1.0 5.0  1 NaN
1 2.0 NaN  2 NaN
2 NaN NaN  3 NaN
3 3.0 4.0  0 0.0

In [138]:
# Drop rows with 2 or more missing

In [139]:
# Fill Nan wwith mean of column C

### 4) .replace() Method

In [140]:
df.replace(np.NaN,'IMPUTE VALUE')

              X             Y   Z
0           3.0           5.0   6
1           2.0  IMPUTE VALUE   9
2  IMPUTE VALUE  IMPUTE VALUE  13

### 5) .interpolate() method replaces the NULL values based on a specified method.

In [141]:
df.interpolate(method='linear') # default 'linear' . Specifies the method to use when replacing NULL values
# some other methods: 'cubic','cubispline','nearest','pad','slinear','spline','zero'

    X   Y   Z
0 3.0 5.0   6
1 2.0 5.0   9
2 2.0 5.0  13

### Example

In [142]:
temps = pd.DataFrame({'seq_num':[1,2,3,4,5],
                      'measure_type':['actual','actual',None,'estimated','estimated'],
                      'temperature':[75,80,None,90,50]})
temps

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
2        3         None          NaN
3        4    estimated         90.0
4        5    estimated         50.0

In [143]:
temps.isna()

   seq_num  measure_type  temperature
0    False         False        False
1    False         False        False
2    False          True         True
3    False         False        False
4    False         False        False

### How is missing data handled?

In [144]:
temps['temperature'].cumsum()

0    75.0
1   155.0
2     NaN
3   245.0
4   295.0
Name: temperature, dtype: float64

In [145]:
temps['temperature'].cumsum(skipna=False)

0    75.0
1   155.0
2     NaN
3     NaN
4     NaN
Name: temperature, dtype: float64

In [146]:
# can specify to retain NA dimensions in grouping
temps.groupby(by=['measure_type']).max()

              seq_num  temperature
measure_type
actual              2         80.0
estimated           5         90.0

#### Dealing with missing data: The blunt approach using `dropna()`

In [147]:
# drop rows with null using axis=0 (default)
temps.dropna()

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
3        4    estimated         90.0
4        5    estimated         50.0

In [148]:
# drop columns with null using axis=1 
temps.dropna(axis=1)

   seq_num
0        1
1        2
2        3
3        4
4        5

In [149]:
temps.fillna(0)

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
2        3            0          0.0
3        4    estimated         90.0
4        5    estimated         50.0

In [150]:
temps.fillna(method='pad') # carry over value from the prior rows

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
2        3       actual         80.0
3        4    estimated         90.0
4        5    estimated         50.0

In [151]:
temps.interpolate()

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
2        3         None         85.0
3        4    estimated         90.0
4        5    estimated         50.0

### Section 6. Conversion of 0s to NaNs so 0s are not Included in Statistics (sum/mean/std) Calculation

In [152]:
for col in ['seq_num','measure_type','temperature']:
    temps[col] = temps[col].replace(0,np.nan)
temps

   seq_num measure_type  temperature
0        1       actual         75.0
1        2       actual         80.0
2        3         None          NaN
3        4    estimated         90.0
4        5    estimated         50.0

#### Note: The course materials are developed mainly based on personal experience and contributions from the Python learning community
Referred Books: 
- Learning Python, 5th Edition by Mark Lutz
- Python Data Science Handbook, Jake, VanderPlas
- Python for Data Analysis, Wes McKinney 

Copyright ©2023 Mei Najim. All rights reserved.